<?xml version="1.0" ?>
<net batch="1" name="decoder" version="5">
	<layers>
		<layer id="0" name="0" precision="FP32" type="Input">
			<output>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="18/Output_0/Data__const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="0" size="12"/>
			</blobs>
		</layer>
		<layer id="2" name="19" precision="FP32" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="215_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
			<blobs>
				<custom offset="12" size="2048"/>
			</blobs>
		</layer>
		<layer id="4" name="217_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
			<blobs>
				<custom offset="12" size="2048"/>
			</blobs>
		</layer>
		<layer id="5" name="51/TensorIterator" precision="FP32" type="TensorIterator">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="5">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
			<port_map>
				<input axis="0" external_port_id="0" internal_layer_id="0" internal_port_id="0" part_size="1" stride="1"/>
				<input external_port_id="1" internal_layer_id="1" internal_port_id="1"/>
				<input external_port_id="2" internal_layer_id="1" internal_port_id="2"/>
				<output axis="0" external_port_id="3" internal_layer_id="2" internal_port_id="1" part_size="1" stride="1"/>
				<output external_port_id="4" internal_layer_id="1" internal_port_id="5"/>
				<output external_port_id="5" internal_layer_id="1" internal_port_id="6"/>
			</port_map>
			<back_edges>
				<edge from-layer="1" from-port="5" to-layer="1" to-port="1"/>
				<edge from-layer="1" from-port="6" to-layer="1" to-port="2"/>
			</back_edges>
			<body>
				<layers>
					<layer id="0" name="51/input_squeeze" precision="FP32" type="Reshape">
						<data dim="-1,256"/>
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>1</dim>
								<dim>256</dim>
							</port>
						</input>
						<output>
							<port id="1">
								<dim>1</dim>
								<dim>256</dim>
							</port>
						</output>
					</layer>
					<layer id="1" name="51/LSTMCell" precision="FP32" type="LSTMCell">
						<data hidden_size="512"/>
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>256</dim>
							</port>
							<port id="1">
								<dim>1</dim>
								<dim>512</dim>
							</port>
							<port id="2">
								<dim>1</dim>
								<dim>512</dim>
							</port>
						</input>
						<output>
							<port id="5">
								<dim>1</dim>
								<dim>512</dim>
							</port>
							<port id="6">
								<dim>1</dim>
								<dim>512</dim>
							</port>
						</output>
						<blobs>
							<weights offset="20431780" size="6291456"/>
							<biases offset="26723236" size="8192"/>
						</blobs>
					</layer>
					<layer id="2" name="51output_unsqueeze" precision="FP32" type="Reshape">
						<data dim="1,-1,512"/>
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>512</dim>
							</port>
						</input>
						<output>
							<port id="1">
								<dim>1</dim>
								<dim>1</dim>
								<dim>512</dim>
							</port>
						</output>
					</layer>
				</layers>
				<edges>
					<edge from-layer="0" from-port="1" to-layer="1" to-port="0"/>
					<edge from-layer="1" from-port="5" to-layer="2" to-port="0"/>
				</edges>
			</body>
		</layer>
		<layer id="6" name="63/Output_0/Data__const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>2</dim>
				</port>
			</output>
			<blobs>
				<custom offset="2060" size="8"/>
			</blobs>
		</layer>
		<layer id="7" name="64" precision="FP32" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="65" precision="FP32" type="FullyConnected">
			<data alpha="0" beta="0" out-size="9956"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>9956</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2068" size="20389888"/>
				<biases offset="20391956" size="39824"/>
			</blobs>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="2" to-port="0"/>
		<edge from-layer="1" from-port="1" to-layer="2" to-port="1"/>
		<edge from-layer="2" from-port="2" to-layer="5" to-port="0"/>
		<edge from-layer="3" from-port="1" to-layer="5" to-port="1"/>
		<edge from-layer="4" from-port="1" to-layer="5" to-port="2"/>
		<edge from-layer="5" from-port="3" to-layer="7" to-port="0"/>
		<edge from-layer="6" from-port="1" to-layer="7" to-port="1"/>
		<edge from-layer="7" from-port="2" to-layer="8" to-port="0"/>
	</edges>
	<meta_data>
		<MO_version value="2019.1.0-341-gc9b66a2"/>
		<cli_parameters>
			<data_type value="float"/>
			<disable_fusing value="False"/>
			<disable_gfusing value="False"/>
			<disable_nhwc_to_nchw value="False"/>
			<disable_omitting_optional value="False"/>
			<disable_resnet_optimization value="False"/>
			<enable_concat_optimization value="False"/>
			<enable_flattening_nested_params value="False"/>
			<extensions value="DIR"/>
			<framework value="onnx"/>
			<generate_deprecated_IR_V2 value="False"/>
			<input_model value="DIR/decoder.onnx"/>
			<input_model_is_text value="False"/>
			<k value="DIR/CustomLayersMapping.xml"/>
			<keep_shape_ops value="False"/>
			<legacy_mxnet_model value="False"/>
			<log_level value="ERROR"/>
			<mean_scale_values value="{}"/>
			<mean_values value="()"/>
			<move_to_preprocess value="False"/>
			<output_dir value="DIR"/>
			<remove_output_softmax value="False"/>
			<reverse_input_channels value="False"/>
			<save_params_from_nd value="False"/>
			<scale_values value="()"/>
			<silent value="False"/>
			<version value="False"/>
			<unset unset_cli_parameters="batch, counts, finegrain_fusing, freeze_placeholder_with_value, input, input_checkpoint, input_meta_graph, input_proto, input_shape, input_symbol, mean_file, mean_file_offsets, model_name, nd_prefix_name, output, placeholder_shapes, pretrained_model_name, saved_model_dir, saved_model_tags, scale, tensorboard_logdir, tensorflow_custom_layer_libraries, tensorflow_custom_operations_config_update, tensorflow_object_detection_api_pipeline_config, tensorflow_operation_patterns, tensorflow_subgraph_patterns, tensorflow_use_custom_operations_config"/>
		</cli_parameters>
	</meta_data>
</net>
